DhariwalUNet(
  (map_noise): PositionalEmbedding()
  (map_layer0): Linear()
  (map_layer1): Linear()
  (enc): ModuleDict(
    (32x32_conv): Conv2d()
    (32x32_block0): UNetBlock(
      (norm0): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (32x32_block1): UNetBlock(
      (norm0): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (32x32_block2): UNetBlock(
      (norm0): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (32x32_block3): UNetBlock(
      (norm0): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (16x16_down): UNetBlock(
      (norm0): LayerNorm((128, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (16x16_block0): UNetBlock(
      (norm0): LayerNorm((128, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block1): UNetBlock(
      (norm0): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block2): UNetBlock(
      (norm0): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block3): UNetBlock(
      (norm0): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_down): UNetBlock(
      (norm0): LayerNorm((256, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (8x8_block0): UNetBlock(
      (norm0): LayerNorm((256, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block1): UNetBlock(
      (norm0): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block2): UNetBlock(
      (norm0): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block3): UNetBlock(
      (norm0): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (4x4_down): UNetBlock(
      (norm0): LayerNorm((384, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block0): UNetBlock(
      (norm0): LayerNorm((384, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block1): UNetBlock(
      (norm0): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (4x4_block2): UNetBlock(
      (norm0): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (4x4_block3): UNetBlock(
      (norm0): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
  )
  (dec): ModuleDict(
    (4x4_in0): UNetBlock(
      (norm0): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (norm2): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (4x4_in1): UNetBlock(
      (norm0): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
    )
    (4x4_block0): UNetBlock(
      (norm0): LayerNorm((1024, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block1): UNetBlock(
      (norm0): LayerNorm((1024, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block2): UNetBlock(
      (norm0): LayerNorm((1024, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block3): UNetBlock(
      (norm0): LayerNorm((1024, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (4x4_block4): UNetBlock(
      (norm0): LayerNorm((896, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 4, 4), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (8x8_up): UNetBlock(
      (norm0): LayerNorm((512, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((512, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (8x8_block0): UNetBlock(
      (norm0): LayerNorm((896, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block1): UNetBlock(
      (norm0): LayerNorm((768, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block2): UNetBlock(
      (norm0): LayerNorm((768, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block3): UNetBlock(
      (norm0): LayerNorm((768, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (8x8_block4): UNetBlock(
      (norm0): LayerNorm((640, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((384, 8, 8), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_up): UNetBlock(
      (norm0): LayerNorm((384, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((384, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (16x16_block0): UNetBlock(
      (norm0): LayerNorm((640, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block1): UNetBlock(
      (norm0): LayerNorm((512, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block2): UNetBlock(
      (norm0): LayerNorm((512, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block3): UNetBlock(
      (norm0): LayerNorm((512, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (16x16_block4): UNetBlock(
      (norm0): LayerNorm((384, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
      (norm2): LayerNorm((256, 16, 16), eps=1e-05, elementwise_affine=True)
      (qkv): Conv2d()
      (proj): Conv2d()
    )
    (32x32_up): UNetBlock(
      (norm0): LayerNorm((256, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((256, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (32x32_block0): UNetBlock(
      (norm0): LayerNorm((384, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (32x32_block1): UNetBlock(
      (norm0): LayerNorm((256, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (32x32_block2): UNetBlock(
      (norm0): LayerNorm((256, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (32x32_block3): UNetBlock(
      (norm0): LayerNorm((256, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
    (32x32_block4): UNetBlock(
      (norm0): LayerNorm((256, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv0): Conv2d()
      (affine): Linear()
      (norm1): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
      (conv1): Conv2d()
      (skip): Conv2d()
    )
  )
  (out_norm): LayerNorm((128, 32, 32), eps=1e-05, elementwise_affine=True)
  (out_conv): Conv2d()
)